[
  {
    "title": "Full Stack Developer",
    "company": "true",
    "location": "51 Frederick Road, Salford M6 6FP",
    "salary": "£60,000 - £70,000 a year-Full-time",
    "job_type": "Full-time",
    "benefits": [
      "Life insurance",
      "Free parking",
      "Company pension",
      "Private medical insurance",
      "On-site parking"
    ],
    "description": "Company Overview\nXn Global Systems is a leading global provider of hospitality management software, specializing in solutions in point of sale, property management. Our innovative cloud-native systems empower hospitality businesses across more than 50 countries to optimize revenue and improve guest experiences.\nAbout the Role\nWe are seeking a skilled\nIntegration Developer\nto join our technical team. This role is ideal for professionals with a strong background in\nMicrosoft-based software development\nand a passion for designing and delivering high-quality, secure, and scalable integration solutions. You’ll be working on integration projects primarily supporting Point of Sale (POS) environments within the F&B for the Hotel / Hospitality industry, maintaining secure and efficient interfaces between diverse systems.\nKey Responsibilities\nDevelop software solutions using\nMicrosoft Visual Studio / C# / .NET\n.\nDesign and build\nWindows services\nfor backend integrations.\nDevelop and maintain\nweb applications and services\ntargeting\nMicrosoft IIS\n.\nCollaborate on software solutions using\nnetwork programming techniques\n(e.g. sockets, TCP-level integrations).\nImplement secure coding practices aligned with industry standards.\nContribute to architecture discussions ensuring systems remain\nstateless\nwhere possible.\nDevelop solutions that maintain systems\nout of PCI DSS scope\n, with an understanding of compliance requirements.\nSupport projects involving\ncredit card processing systems\n, focusing on\ncardholder present transaction scenarios\n.\nWork with\nPOS systems\n,\nEngage with\nPMS and TMS systems\n, understanding principles of integration with POS platforms.\nRequired Skills & Experience\nStrong experience in\nsoftware development using Microsoft Visual Studio, C#, and .NET\n.\n5 years of integration experience\nHands-on experience developing\nWindows Services\n.\nSolid background in\nweb application/service development\non\nMicrosoft IIS\n.\nPractical knowledge of\nnetwork programming\nand common web service architectures (XML, JSON).\nUnderstanding of\nsecure software development standards and practices\n.\nAwareness of\nPCI DSS principles\n, with the focus on maintaining systems outside PCI scope.\nGeneral understanding of the\ncredit card industry\n, including transaction types and workflows.\nDesirable (Nice to Have)\nKnowledge of POS Systems\nKnowledge/experience with\nMS SQL\n(considered a plus, but not essential).\nGeneral understanding of\nPMS (Property Management Systems)\nand\nTMS (Table Management Systems)\nand their integrations with POS solutions.\nWhy Join Us?\nWork on high-impact integration projects across global hospitality and retail environments.\nCollaborate with a skilled, supportive team.\nOpportunity to shape secure, scalable, and efficient software solutions.\nCompetitive compensation and development opportunities.\nJob Type: Full-time\nPay: £60,000.00-£70,000.00 per year\nBenefits:\nCompany pension\nFree parking\nLife insurance\nOn-site parking\nPrivate medical insurance\nEducation:\nBachelor's (preferred)\nExperience:\nSoftware integration : 5 years (required)\nLocation:\nSalford M6 6FP (required)\nWork Location: In person",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Dnm-ZtsbSHxVLg7Vq2fssK8CGuwxEfImrYiJtrjyCLlcO5ho0I1Jfr9V8EDxpQb-RHmUUFvQttNMqw_8wt14eXiaVGSTkjeCFwtrmC323gkn53RekTR7Ff6CY5AVqpzZ9DSWtBFAyhUrEIL95OVzchm-YT7JWOHFOFeLifzSZjxiSEKaHy1rgTWrd-pe0jLqamQzZE3NaO_MyR42dAFWBmPUa_I6DdxK0wneZvk0ScNq1M3XVp-2G71pgytgrbgk8QxccCwzO7k5UghInQlZjiZF076JXI7PWTlsLwXk8tiYI54Ldxkff2pyHNu6htQv-0weWUncTUOQX03HcIPlK1gsSuylkvbTwTiFSCSdN4R_pEelcI_MbJlRDPVsFT7Crzb6UFgqjoioaSfxaOWyBXGYswm-H62eeclkfBF4Kg1uHJvKeZbsDMsCv17gZeeMC5yKdulqGlAQVnCfodL13kKGGqYDy06aWVX8r6JmVhwGq7l0x9IBGqUTWSTKvL_4Y_G_gx8Ir9vrSRGLUBClPlefdQ97-kOIxDp6yefN-uFj2QQWRDdHaBsgPpYaUP8mqdGrF_9HXHiuJOE9OnfyhWzP0Idf7-J8KF1rl4NwhmVWKBO1yCfCX2Cxb3FBvA4g72JcSBol0iyiphw2QB_c0_CS-3yQ8s_tAtQne1ajgvytOKCGEPy6MKuJ82TzyTE_T8uc7-NX9StiCjMoOQ1CmojHeKH3ndDNU=&xkcb=SoA96_M3qblHrngdeD0LbzkdCdPP&camk=UoKtGZLa3XLMrSOTPZ25kA==&p=0&fvj=0&vjs=3"
  },
  {
    "title": "IT Support & Installation Engineer",
    "company": "true",
    "location": "Unit 10, Berkeley Business Park, Turner Street, Ashton-Under-Lyne OL6 8LB",
    "salary": "£30,000 - £35,000 a year-Full-time",
    "job_type": "Full-time",
    "benefits": [
      "Employee discount",
      "Free parking",
      "Company pension",
      "Casual dress",
      "On-site parking"
    ],
    "description": "OneTek\nbuilds and runs rock-solid infrastructure for SMBs across the Northwest, then pushes it further—AI-enabled CCTV, SMART Place tech, custom sensors, resilient networks in tough environments. We’re a small, high-calibre team that solves problems most people never see.\nThe role\nYou’ll split your time between\nhands-on installs\nand\nsmart configuration\n. One day you’re racking servers, pulling fibre and commissioning CCTV on a windswept public site; the next you’re shaping a clean Windows/Hyper-V build, tightening backup policies, and smoothing a tricky Office 365 migration. If you like a neat ticket queue and an easy 4:30 finish, this isn’t it. If you want to\nstretch your capability\nand be trusted to figure things out, you’ll love it.\nWhat you’ll do\nBuild & configure\nWindows Server (2019/2022), Hyper-V, AD/Group Policy, Office 365/SharePoint, Veeam, and core networking.\nInstall & integrate\n: structured cabling, switching, Wi-Fi, servers, CCTV (Axis/Avigilon), ANPR (MAV Systems), VoIP (3CX—hosted & self-hosted).\nOwn the outcome\n: diagnose across hardware, software, and network layers; test thoroughly; document clearly.\nWork the field\n: office/workshop prep, then on-site deployment across public domain projects and heavy-industrial environments.\nGrow others\n: mentor junior engineers and, over time, step into\nteam-lead\nresponsibilities.\nWhat you’ll bring\n3+ years\nin IT support/infrastructure with real-world install experience (servers, networks, desktops).\nConfident with\nnetwork fundamentals\n(switching, VLANs, routing, security) and reading/producing simple diagrams.\nBonus points for any of:\n3CX, SQL Server, RMM tools, HP/Dell server hardware, Axis/Avigilon CCTV, MAV ANPR\n,\nOpenStack, Linux, C# .NET, Python.\nCuriosity, grit, and calm under pressure—you like puzzles, new tech, and getting things working\nproperly\n.\nFull UK driving licence\nand willingness to travel (~50%).\nFluent English\nand\nUK work authorisation\nrequired.\nDon’t have every box ticked? If you’ve got core server/network chops and the attitude to learn, we’ll back you—extensive training provided where needed.\nWhat you’ll get\n£30,000–£35,000 DOE\n+\nperformance/yearly bonuses\nCompany vehicle or mileage allowance\n, tools/PPE for site work\nPension\n, employee discounts, on-site parking\nFunded\ncertifications\n(Microsoft/Cisco/CompTIA) and in-house training\nA\nclear path to team leadership\nas we scale\nWhy OneTek?\nBecause we do\nreal engineering\n. We take traditional IT, then redeploy it in places most providers won’t go—city-wide wireless, industrial resilience, edge AI. You won’t fade into the background here; you’ll be central to how we deliver, learn fast, and see your impact every week.\nReady to step up?\nSend your CV and a short note about a gnarly problem you solved in the wild. Let’s talk.\nJob Type: Full-time\nPay: £30,000.00-£35,000.00 per year\nBenefits:\nCasual dress\nCompany pension\nEmployee discount\nFree parking\nOn-site parking\nExperience:\nIT Support/infrastructure: 3 years (required)\nRemote Monitoring: 2 years (preferred)\nNetwork Management: 2 years (preferred)\nVoip Phone systems: 2 years (preferred)\nBackup Solution: 2 years (required)\nOffice 365: 2 years (required)\nWork Location: In person",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0B_iiEoefKFywEMwksyZzP6zCKiuS5JNl6cK311-E1e92fbYh4BEIdusew4luQBhI-513Xgd6G_v--gUkJ_wcjMJeIDbNGPHppprJFYaRx1tr4Jassr7oEgJdcyc1cShRVwtyBNzfKw06gj74jdoXizwpcjJVn5c_Ni_WAj_izN9n9txUZBI5VOks_rDqWw_wQA1rR6grGf0aq94Rr5YV7uyA-TAntkIKh7RUjJRbbfB_gwI-m7UOJOkAegGG0jEJUAKOFPEPjn_1nLKAsxNOaK6N-FC3coRVnWZGeT2yJXtkPrmBA7LvwNXsgzdUDw-HRR4usEXL4l4HOre0voETr1iv45DQj6lCNvYsV_t0hK2YURW9nzdDmZUpG03mdHLI-uF1YxpvwncFEQKk9X9cjz2_lPNZ5d464c-3Zu71I6roGg1qUBImHLyw3CCd0uaJm0eZLWDjTmG5Q43kMBx7UpyYv1tfl7P57QSR15BId2lFPQKD3T_fvZVtDyhfUmLWeJ-GY3_hVUGa3MmyrtlkjLkH8lFhvT59NloRraKoxV44vC4OQZj-bBFTaRMnhSgMO0Z7TqyCOCPdYGuSMEtg0LANSQu56UTHDJRtgIuxEwkTiPsgq0lSOM-CSV1V9NPTkTQYi0FTwYOAgqtlYDb6KUBKDMDWHxLJf0naOzqclrw6c-puSsI5br10KSpHcsvcpD1O8QdTluB5Fow8zTbqSprsnrSHGosUybEsw2-7n9_Q==&xkcb=SoCJ6_M3qblHrngdeD0KbzkdCdPP&camk=UoKtGZLa3XJkgo7h4riziw==&p=1&fvj=0&vjs=3"
  },
  {
    "title": "Graduate Software Engineer (2026 Cohort)",
    "company": "true",
    "location": "Manchester M1",
    "salary": null,
    "job_type": "Full-time",
    "benefits": [
      "Annual leave",
      "Company pension",
      "Company events",
      "Enhanced maternity leave"
    ],
    "description": "Applications are now open for our 2026 Graduate Cohort (Software Engineering)!\nWho we are:\nAshton Fire is a dynamic and rapidly growing Fire Safety and Engineering Consultancy. Operating from an ethical platform, our social and environmental values are at the core of our organisation and service delivery. We strive to provide the highest quality, morally and ethically balanced service to our clients whilst maintaining a team-focused working environment.\nApplication process:\nApplications are open until\nFriday, 5th December 2025\n.\nAll applicants will be contacted with the outcome of their application by\nFriday, 12th December 2025.\nShortlisted candidates will then be invited to interview in Manchester in January 2026.\nOffers will be made to successful candidates by\nMonday, 26th January 2026\n. Our 2026 Graduate Cohort will officially begin on\nTuesday, 1st September 2026.\nPerks & Benefits:\nMost of our benefits are available to all employees from the first day of employment.\nHybrid Approach:\nWork a blend of where you’re most productive- whether from home or the office, the choice is yours.\n9-Day Fortnight:\nEnjoy an extra day off every two weeks, giving you more time to focus on what matters most.\nCore Hours:\nShape your workweek around our flexible core hours, making it easier to balance work and life.\n25 Days Holiday:\nTake time to recharge with 25 days holiday (+ bank holidays), rising to 30 days at 9 years’ service.\nFlexible Bank Holidays:\nChoose when to take your bank holidays, giving you the freedom to celebrate what matters to you.\nEnhanced Pension:\nEnjoy peace of mind for the future with 6% employer pension contributions, rising to 8% at 5 years’ service.\nEnhanced Parental Leave:\nEnhanced maternity leave and one month of fully paid paternity leave.\nPrivate Medical:\nComprehensive health coverage through Bupa, plus access to our health cash plan.\nMental Health Support:\n24/7 access to medical advice through our Employee Assistance Programme.\nBonus Scheme:\nAnnual discretionary bonus based on both company and personal performance.\nProfessional Registration Scheme:\nBonus scheme to award for becoming chartered and registering for membership with professional institutions.\nChristmas Shutdown:\nEnjoy a company-wide break between Christmas and New Year on top of your annual leave.\nCompany Events:\nMonthly socials with your local office and three company-wide events per year.\nAbout the role:\nAs a Graduate Software Engineer, you’ll join our Manchester-based software team to help shape the future of fire engineering through innovation and automation. Working closely with senior engineers, you’ll design and develop tools and systems that make our work smarter, faster, and more data-driven. You’ll have the chance to work across a range of projects, from engineering calculators, automated reporting tools, and APIs to AI-driven analysis platforms, directly impacting how we deliver services to colleagues and clients. This is a hands-on role for someone who’s curious, proactive, and eager to learn.\nWe will provide a supportive environment for you to develop both personally and professionally, and we want you to be proactive in this by being accountable for achieving your personal and our collective goals.\nResponsibilities:\nSupport the design, development, and maintenance of internal software applications.\nCollaborate with senior engineers to identify and implement automation opportunities.\nWork with AI and machine learning technologies to solve real-world problems.\nHelp maintain coding standards, version control, and testing practices.\nEngage with non-technical stakeholders to understand workflows and deliver practical solutions.\nContribute to web, desktop, and data tools that improve internal efficiency and client experience.\nTake part in continuous improvement of your software engineering skills, innovation, and knowledge sharing across the team.\nMaintain a positive team environment to promote the overall interests of the company.\nWho you are:\nA degree in Computer Science or a related field (Maths, Engineering, Physics, etc.)\nProficiency in Python (other languages are a bonus).\nInterest or experience with AI and ML technologies.\nAwareness of software development best practices - version control, testing, and documentation.\nStrong communication and problem-solving skills.\nA proactive, collaborative, and detail-oriented approach.\nPassion for innovation and continuous improvement.\nAt Ashton Fire, we are committed to creating an inclusive and diverse workplace, providing equal opportunities where everyone feels valued and respected. We welcome applications from all individuals, regardless of age (within legal limits), disability, gender identity, marital status, pregnancy or maternity, race, religion or belief, sex, or sexual orientation. We believe that a diverse team brings a wide range of perspectives, experiences, and ideas - and that's what drives innovation and excellence in everything we do.",
    "url": "https://uk.indeed.com/viewjob?jk=98acb282f8ea126a"
  },
  {
    "title": "Junior Software Developer",
    "company": "true",
    "location": "Manchester",
    "salary": "Up to £26,500 a year-Full-time",
    "job_type": "Full-time",
    "benefits": [],
    "description": "About Skuuudle\nSkuuudle is the leader in pricing intelligence and competitor monitoring solutions. Our mission is to provide retailers, distributors and brands with price and product intelligence, enabling them to optimise margins and increase market share through data-driven decision making.\nAlthough we are well established within our market, we are proud of our start-up culture of collaboration and ingenuity. We value bright, intellectually curious individuals who want to work hard on challenging problems. We have created a culture of continuous improvement and are now looking for a talented, hard-working Junior Software Developer to play a key role in project delivery and exceed our clients' expectations.\nAbout You\nThis is a fantastic opportunity for a recent graduate and passionate coder to take their first step into a commercial development role. There are some attributes that we expect the successful candidate to have, and they’re listed below, but the key for us is to find someone who is bright, collaborative and intellectually curious and who wants to work hard on challenging problems.\nThe Day-to-Day\nYou’ll be developing software solutions for web crawling and reporting in Python and SQL to service some of the world's largest retailers and brands. Your work will support household names in setting their pricing strategy through data-driven decision making.\nWhat We’re Looking For:\nFirst Class Bachelor’s Degree in a relevant subject (Computer Science, Maths, Physics etc.)\nExceptional problem-solving ability and tenacity.\nConfident coding in Python.\nStrong work ethic.\nExcellent written and verbal communication skills in English.\nWhat Makes You Stand Out:\nA portfolio of previous work or GitHub account we can review\nCommercial software development experience\nExperience working with relational databases and SQL\nExperience writing software for web crawling\nE-Commerce experience\nLocation\nAs much as we love to see our team at our Manchester HQ, we are open to receiving applications from remote candidates based in the UK.\nSalary\nUp to £26,500/year.",
    "url": "https://uk.indeed.com/viewjob?jk=7b48ce021405a641"
  },
  {
    "title": "Software Engineer - Java - Engine by Starling",
    "company": "true",
    "location": "Manchester",
    "salary": null,
    "job_type": "Full-time",
    "benefits": [
      "Referral programme",
      "Annual leave",
      "Employee discount",
      "Life insurance",
      "Company pension",
      "Paid volunteer time",
      "Private medical insurance"
    ],
    "description": "At Engine by Starling, we are on a mission to find and work with leading banks all around the world who have the ambition to build rapid growth businesses, on our technology.\nEngine is Starling's software-as-a-service (SaaS) business, the technology that was built to power Starling, and two years ago we split out as a separate business.\nStarling has seen exceptional growth and success, and a large part of that is down to the fact that we have built our own modern technology from the ground up. This SaaS technology platform is now available to banks and financial institutions all around the world, enabling them to benefit from the innovative digital features, and efficient back-office processes that has helped achieve Starling's success.\nAs a company, everyone is expected to roll up their sleeves to help deliver great outcomes for our clients. We are an engineering led company and we’re looking for people who are will be excited by the potential for Engine’s technology to transform banking in different markets around the world. Our purpose is underpinned by five values: Listen, Keep It Simple, Do The Right Thing, Own It, and Aim For Greatness.\nHybrid Working\nWe have a Hybrid approach to working here at Engine - our preference is that you're located within a commutable distance of our offices so that we're able to interact and collaborate in person.\nAbout Engineering at Engine by Starling - https://www.enginebystarling.com/\nEngine careers page - https://enginebystarling.com/careers/\nWe’re looking for Backend Software Engineers to work on the Engine Platform and make our existing features work for banks all over the world as well as building new features from scratch that Starling hasn’t released in the UK market.\nEngine by Starling engineers are excited about helping us deliver new features, regardless of what their primary tech stack may be. Hear more from the team in some case studies, below, and our work with Women In Tech.\nDay in the Life of a Software Engineer\nRunning a Backend Team\nWe are looking for engineers at all levels to join the team. We value people being engaged and caring about customers, caring about the code they write and the contribution they can make to banking around the world. People with a broad ability to apply themselves to a multitude of problems and challenges, who can work across teams do great things here at Engine, to continue changing banking for good.\nAs an Engineer you will:\nContribute to our award winning platform and internal tooling\nBuild new features and products from scratch in a configurable way\nShare your knowledge with those around you, contributing to our learning culture\nOwn your projects, working in small teams across the bank to collaboratively deliver\nAim for greatness in everything you do, staying curious and inquisitive\nBe part of a scaling team and organisation as we change banking for good\nRequirements:\nWe’re open-minded when it comes to hiring and we care more about aptitude and attitude than specific experience or qualifications. We are very open about how we deliver software. For the most part we code in Java, but you need not be an expert when you join us! We believe in clean coding, simple solutions, automated testing and continuous deployment. If you care enough to find elegant solutions to difficult technical problems, we’d love to hear from you.\nWe have built our entire banking platform in house and mostly in Java. We are looking for people who want to work on building the tooling that is used by our engineers on a daily basis.\nThe main part of our Backend Tech Stack is listed below, we don't ask that you have experience in all of this, but if you do, that's great!\nJava, which makes up the majority of our backend codebase\nAWS & GCP - we're cloud-native\nMicroservice based architecture\nKubernetes (EKS)\nTeamCity for CI / CD (with multiple production releases per day)\nTerraform and Grafana\nOur Interview process\nInterviewing is a two way process and we want you to have the time and opportunity to get to know us, as much as we are getting to know you! Our interviews are conversational and we want to get the best from you, so come with questions and be curious. In general you can expect the below, following a chat with one of our Talent Team:\nInitial interview with an Engineer - ~45 minutes\nTake home technical test to be discussed in the next interview\nTechnical interview with some Engineers - ~1.5 hours\nFinal interview with our CTO / deputy CTO ~45 minutes\nBenefits:\n33 days holiday (including public holidays, which you can take when it works best for you)\nAn extra day’s holiday for your birthday\nAnnual leave is increased with length of service, and you can choose to buy or sell up to five extra days off\n16 hours paid volunteering time a year\nSalary sacrifice, company enhanced pension scheme\nLife insurance at 4x your salary & group income protection\nPrivate Medical Insurance with VitalityHealth including mental health support and cancer care. Partner benefits include discounts with Waitrose, Mr&Mrs Smith and Peloton\nGenerous family-friendly policies\nIncentives refer a friend scheme\nPerkbox membership giving access to retail discounts, a wellness platform for physical and mental health, and weekly free and boosted perks\nAccess to initiatives like Cycle to Work, Salary Sacrificed Gym partnerships and Electric Vehicle (EV) leasing\nAbout Us\nYou may be put off applying for a role because you don't tick every box. Forget that! While we can’t accommodate every flexible working request, we're always open to discussion. So, if you're excited about working with us, but aren’t sure if you're 100% there yet, get in touch anyway. We’re on a mission to radically reshape banking – and that starts with our brilliant team. Whatever came before, we’re proud to bring together people of all backgrounds and experiences who love working together to solve problems.\nEngine by Starling is an equal opportunity employer, and we’re proud of our ongoing efforts to foster diversity & inclusion in the workplace. Individuals seeking employment at Engine by Starling are considered without regard to race, religion, national origin, age, sex, gender, gender identity, gender expression, sexual orientation, marital status, medical condition, ancestry, physical or mental disability, military or veteran status, or any other characteristic protected by applicable law.\nWhen you provide us with this information, you are doing so at your own consent, with full knowledge that we will process this personal data in accordance with our Privacy Notice. By submitting your application, you agree that Engine by Starling and Starling will collect your personal data for recruiting and related purposes. Our Privacy Notice explains what personal information we will process, where we will process your personal information, its purposes for processing your personal information, and the rights you can exercise over our use of your personal information.",
    "url": "https://uk.indeed.com/viewjob?jk=ab83fac20125514a"
  },
  {
    "title": "Software Engineer",
    "company": "true",
    "location": "Manchester",
    "salary": null,
    "job_type": null,
    "benefits": [],
    "description": "At Anaplan, we are a team of innovators focused on optimizing business decision-making through our leading AI-infused scenario planning and analysis platform so our customers can outpace their competition and the market.\nWhat unites Anaplanners across teams and geographies is our collective commitment to our customers' success and to our Winning Culture.\nOur customers rank among the who's who in the Fortune 50. Coca-Cola, LinkedIn, Adobe, LVMH and Bayer are just a few of the 2,400+ global companies who rely on our best-in-class platform.\nOur Winning Culture is the engine that drives our teams of innovators. We champion diversity of thought and ideas, we behave like leaders regardless of title, we are committed to achieving ambitious goals, and we love celebrating\nour wins – big and small.\nSupported by operating principles of being strategy-led, values-based and disciplined in execution, you'll be inspired, connected, developed and rewarded here. Everything that makes you unique is welcome; join us and let's build what's next - together!\nWe seek a talented mid-level\nSoftware Develope\nr to join our growing engineering team as an individual contributor. You will work closely with our Engineering Manager and cross-functional teams to build scalable web applications and cloud-based solutions using modern technologies. This role offers the opportunity to contribute to architectural decisions while focusing on delivering high-quality code and technical solutions.\nYour Impact\nDevelop and maintain scalable web applications using .NET Core/5+ and modern UI frameworks\nWrite clean, maintainable, and well-tested code following established engineering best practices\nCollaborate with engineering teams, product management, and design to implement technical solutions\nParticipate in code reviews and contribute to improving development standards and processes\nBuild and maintain RESTful APIs and integrate with third-party services\nWork with cloud platforms (Azure/AWS) to deploy and maintain applications\nContribute to technical design discussions and architectural decisions\nImplement automated testing strategies and participate in CI/CD pipeline development\nTroubleshoot and resolve technical issues across the full software development lifecycle\nParticipate in Agile/Scrum ceremonies and contribute to sprint planning and estimation\nStay current with emerging technologies and recommend improvements to existing systems\nMentor junior developers and contribute to knowledge sharing within the team\nYour Qualifications\n3-5 years of professional software development experience\nStrong proficiency in .NET framework and .NET Core/5+ development\nExperience with modern UI frameworks (Angular, React, or Vue.js)\nSolid understanding of web development fundamentals (HTML, CSS, JavaScript)\nExperience with cloud platforms, preferably Azure or AWS\nProficiency in database design and development (SQL Server, PostgreSQL, or similar)\nUnderstanding of software architecture patterns and design principles\nExperience with version control systems (Git) and collaborative development workflows\nKnowledge of API design and development (REST, JSON)\nFamiliarity with Agile/Scrum methodologies\nStrong problem-solving skills and attention to detail\nExcellent communication and collaboration abilities\nBachelor's degree in Computer Science, Engineering, or related field, or equivalent experience\nNice to Have\nExperience with containerization technologies (Docker, Kubernetes)\nKnowledge of DevOps practices including CI/CD pipelines and infrastructure as code\nExperience with automated testing frameworks and test-driven development\nKnowledge of GraphQL and modern API development practices\nExperience with monitoring and logging tools (Application Insights, New Relic, etc.)\nUnderstanding of security best practices and secure coding principles\nExperience with mobile development or full-stack development\nKnowledge of performance optimization and scalability considerations\nPrevious experience in a startup or high-growth technology environment\nOur Commitment to Diversity, Equity, Inclusion and Belonging (DEIB)\nWe believe attracting and retaining the best talent and fostering an inclusive culture strengthens our business. DEIB improves our workforce, enhances trust with our partners and customers, and drives business success. Build your career in a place where diversity, equity, inclusion and belonging aren't just words on paper – this is what drives our innovation, it's how we connect, and it contributes to what makes us a market leader. We believe in a hiring and working environment where all people are respected and valued, regardless of gender identity or expression, sexual orientation, religion, ethnicity, age, neurodiversity, disability status, citizenship, or any other aspect which makes people unique. We hire you for who you are, and we want you to bring your authentic self to work every day!\nWe will ensure that individuals with disabilities are provided reasonable accommodation to participate in the job application or interview process, perform essential job functions, and receive equitable benefits and all privileges of employment. Please contact us to request accommodation.\nFraud Recruitment Disclaimer\nIt has come to our attention that fraudulent and fictitious job opportunities are being circulated on the Internet. Prospective candidates are being contacted by certain individuals, mainly through telephone calls, emails and correspondence, claiming they are representatives of Anaplan. The main purpose of these correspondences and announcements is to obtain privileged information from individuals.\nAnaplan does not:\nExtend offers to candidates without an extensive interview process with a member of our recruitment team and a hiring manager via video or in person.\nSend job offers via email. All offers are first extended verbally by a member of our internal recruitment team whenever possible and then followed up via written communication.\nAll emails from Anaplan would come from an @anaplan.com email address. Should you have any doubts about the authenticity of an email, letter or telephone communication purportedly from, for, or on behalf of Anaplan, please send an email to people@anaplan.com before taking any further action in relation to the correspondence.",
    "url": "https://uk.indeed.com/viewjob?jk=194d0c09e1847c82"
  },
  {
    "title": "Software Engineer",
    "company": "true",
    "location": "4 Exchange Quay, Manchester M5",
    "salary": null,
    "job_type": "Full-time",
    "benefits": [
      "Sick pay",
      "Gym membership",
      "Private dental insurance",
      "Company pension",
      "Paid volunteer time",
      "Private medical insurance",
      "Casual dress"
    ],
    "description": "Job Description\nWe now have an exciting opportunity for a Software Engineer to join a forward thinking company offering a collaborative team working environment, training and excellent career progression.\nOur strategy is to have a cross functional development team, with team members working on all areas of our technology stack and propositions.\nWhat we're looking for:\nWe’re looking for an intelligent, energetic and driven software engineer to help us deliver our brand, products and services to our clients and their advisers. People who are excited by technology, love pushing the boundaries of what's possible while at the same time keeping an eye on the bigger picture and ensuring the best outcomes for our customers by providing straightforward solutions.\nThis is a challenging role involving a high level of attention to detail but also allows a great deal of flexibility on achieving the right result using the best technology for a given situation. This is a great opportunity for someone who is looking for a fast paced environment which is varied and rewarding.\nYou will be part of a cross-functional Agile team, delivering our enterprise backlog development items. You will have solid experience in delivery of development projects to agreed timescales and quality objectives, working in accordance with defined Agile framework and processes.\nYou will have:\nStrong experience in developing services and APIs using C#\nStrong knowledge of relational and NoSQL databases\nSecure development practices.\nUsing a git-based source control system.\nKnowledge of CI automation systems such as Jenkins\nSome experience of React or Angular frameworks\nExperience working in an Agile and DevOps environment.\nExcellent communication and documentation skills.\nPlanning, organisation, and time management skills.\nStrong analytical and problem-solving skills.\nThe nice to haves:\nMessaging (e.g. RabbitMQ, SQS)\nWorking knowledge of domain-driven design.\nDocker/Kubernetes and container orchestration tools.\nKnowledge of design patterns.\nTest-driven development (TDD).\nAWS cloud infrastructure/Relevant AWS certifications.\nPrevious experience working in e-commerce and/or financial services.\nAbout Us\nAJ Bell is one of the fastest-growing investment platform businesses in the UK offering an award-winning range of solutions that caters for everyone, from professional financial advisers to DIY investors with little to no experience. We have over 620,000 customers using our award-winning platform propositions to manage assets totalling more than £96.1 billion. Our customers trust us with their investments, and by continuously striving to make investing easier, we aim to help even more people take control of their financial futures.\nHaving listed on the Main Market of the London Stock Exchange in December 2018, AJ Bell is now a FTSE 250 company.\nHeadquartered in Manchester with offices in central London and Bristol, we now have over 1,500 employees and have been named one of the UK's 'Best 100 Companies to Work For’ for six consecutive years and in 2024 named a Great Place to Work®.\nAt AJ Bell you can expect a friendly working environment with a strong sense of teamwork, we have a great sense of pride in what we do, and this is reflected in our guiding principles.\nWhat we offer\nCompetitive starting salary\nStarting holiday entitlement of 25, increasing up to 31 days with length of service and a holiday buy and sell scheme\nA choice of pension schemes with matched contributions\nDiscretionary bonus scheme\nAnnual free share awards scheme\nBuy As You Earn (BAYE) Scheme\nHealth Cash Plan – provided by Simply Health\nDiscounted private healthcare scheme and dental plan\nFree gym membership\nEmployee Assistance Programme\nBike loan scheme\nSick pay+ pledge\nEnhanced maternity, paternity, and shared parental leave\nLoans for travel season tickets\nDeath in service scheme\nPaid time off for volunteer work\nCharitable giving opportunities through salary sacrifice\nCalendar of social events, including monthly payday drinks, annual Christmas party, summer party and much more\nPersonal development programmes built around you and your career goals, including access to personal skills workshops\nMonthly leadership breakfasts and lunches\nCasual dress code\nAccess to a range of benefits from our sponsorship deals\nHybrid working\nAt AJ Bell, our people are the heart of our culture. We believe in building strong connections by working together. That's why we offer a hybrid working model, where you’ll spend a minimum of 50% of your working time per month in the office. For new team members, an initial period will be full-time in the office to help you immerse yourself in our business and build valuable relationships with your colleagues.\nAJ Bell is committed to providing an environment of mutual respect where equal employment opportunities are available to all applicants and all employees are empowered to bring their whole self to work.\nWe do not discriminate on the basis of race, sex, gender identity, sexual orientation, age, pregnancy, religion, physical and mental disability, marital status and any other characteristics protected by the Equality Act 2010. All decisions to hire are based on qualifications, merit and business need.\nIf you like the sound of the above, or just want to know more about the company and the role, we'd love to speak to you.",
    "url": "https://uk.indeed.com/viewjob?jk=da08470b0b404e84"
  },
  {
    "title": "Senior Software Developer",
    "company": "true",
    "location": "56 Peter Street, Manchester M2 3NQ",
    "salary": "£50,000 - £55,000 a year-Full-time",
    "job_type": "Full-time",
    "benefits": [
      "Employee discount",
      "Additional leave",
      "Company pension",
      "Company events"
    ],
    "description": "Job Description – Senior Software Developer\nExclusive Law is one of the leading providers of legal services in the Northwest. Our team of dedicated solicitors specialise in assisting clients with personal, criminal, and serious injuries claims, as well as sexual assault claims. We are investing heavily in technology to transform our systems across multiple businesses within Exclusive Law Group. We are seeking a Senior Software Developer to join our in-office IT team. This is a pivotal role, responsible for the development of our core platforms and applications to support business growth and innovation.\nKey Skills, Knowledge and Experience\nEssential\nAdvanced proficiency in Laravel – PHP and C# / .NET frameworks.\nStrong experience in Visual Studio, API development.\nExpert-level SQL Server skills, including database design, maintenance, complex queries, views, stored procedures, and SSRS reporting.\nSolid understanding of REST and SOAP services.\nSkilled in XML / JSON data structures\nExcellent communication and mentoring skills, with the ability to lead by example and collaborate across multiple departments.\nA proactive mindset with a track record of identifying and implementing process or system improvements.\nDesirable\nProclaim Case Management Development not essential\nKey Responsibilities\nPlanning, mapping, developing and testing software requirements.\nWorking on developments required by the business from inception to completion (“Cradle to Grave”).\nMentor and guide junior developers, ensuring adherence to coding standards, best practices and agile principles.\nDocument all development changes and produce development guides.\nReview, refactor and optimise existing codebases for performance, reliability and maintainability.\nMaintain and update business documents and templates.\nCollaborate with cross-functional teams to support Management Information (MI) and automation requirements.\nWhat we offer\nSalary: £50K - £55k (Depending on experience)\nDay off for your birthday\nFree wellbeing and mental health support (Health Assured Employee Assistance programme).\nAccess to retail discounts and company social events\nYour child’s first day of school off work\nDress down Friday every week\nOpportunities for training and career development\nNo bank holiday working\nEmployee of the Month scheme\nLong Service bonus\nExtra holiday for 100% attendance\nSchedule:\nMonday – Friday 7-hour day shifts\nNo weekends\nRequirements\n· Minimum 5 years’ software development experience\n· Demonstrated ability to deliver complex software solutions independently and as part of a collaborative team.\nAbility to commute or relocate to Manchester, M2 3NQ before starting work.\nJob Type: Full-time\nPay: £50,000.00-£55,000.00 per year\nBenefits:\nAdditional leave\nCompany pension\nWork Location: In person\nReference ID: Senior Software Developer",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0D19LQWxBUYWHMGaQUellLe-9DZggaUqR_pVQMqAvNR9IlahO7FWAwIwwtnH8lOnGgOc2YAVZdu63dKJbFfyYIX9n-jIIf8UFeJ9BjOGf3eFzhIRycZSCPOYT_2Ar16LEWcFgdgOxo-y-NddBEddTQ4x5wXn5taCpC5zF-M_AHPoGjZFKm5Pc7kIjEUQia5_m2305cV2CRoHcQSgDL6lAXMkZqA7tmMMt3vMBx6FFuWvr-YV6GbAU0gMGk2DHpaCH6W3A98JlrLXCyOifhObuSqqzsTmmGSUE7CwrHCxzE83v7P8_94N0vZC8OEgILA6EklYu052CiPifBqmhleuQsygH4iUUQEu4KBU0WMAx-4m3StWjpl7TJ17UJvlFHhVdyxogYM0FGieIY-YHzeqseaTc80BxMtK9vVGfuF4ivR9IeqElof2NB43A_bLcKrq5pvCjIBkAaFsI8IJ993gcffjvaZNnxfmQrPYiSiRNEOz5AEfftZxHucIuCsy8uLSYtaGWyUpmk4EKAIVDBEDHyz35yHnznffKm3kY-mHr51278jBxtNIfZeigs0b32L_r6eqE8Js8rIQ2YrxuDHgzpjqoJYRCOYS4SQ7zkHeISkgW-k_qTs0ddG7mcu_Uc0Tdosmo_b7L8uWcFVD7LZojW1Y9I3BzyPAwqsugz2BwBHH44Kfp5A_HVbjbPv0RePyr1vsuj_VjRTe_-F5A6gX3o0&xkcb=SoCz6_M3qblHrngdeD0MbzkdCdPP&camk=UoKtGZLa3XKRLNRMYO_eXA==&p=7&fvj=0&vjs=3"
  },
  {
    "title": "Lead Software Engineer",
    "company": "true",
    "location": "Manchester M2 4JG",
    "salary": "£65,000 - £75,000 a year-Permanent",
    "job_type": "Permanent",
    "benefits": [
      "Work from home"
    ],
    "description": "Lead the development of cutting-edge systems that power millions of users across three continents while shaping the future of microservices architecture.\nLead Software Engineer - Manchester (Hybrid)\nLead the development of real-time, large-scale systems used by millions of users across the UK, North America and South Africa. This is a chance to work on business-critical software that directly drives user engagement and revenue.\nHybrid role based in Manchester city centre (2 days per week onsite)\nSalary: up to £75,000 + bonus\nAbout the Role:\nThe company is transitioning from monolithic architecture to microservices, with full application rebuilds and containerised deployments. As decisions get made at team level, you will have a say in the tech stack and development approach, with a strong emphasis on team collaboration.\nThis is a stimulating environment where systems must operate in real-time, requiring robust event-driven architectures, streaming data pipelines, and reactive programming. You'll tackle complex scalability challenges across distributed systems, ensuring speed and reliability under heavy user loads.\nSecurity and compliance are central to the platform, so you'll be involved in building secure systems with strong authentication, encryption, and adherence to regulatory standards.\nKey Responsibilities:\nAct as a liaison between the Engineering team and Senior Management, communicating project status and technical challenges\nAssume a leadership role in the company, representing the Engineering team and promoting best practices in software development.\nFeature development and evaluation of the tooling processes both in development and deployment alongside the Platform Engineering team.\nHelp resolve complex software challenges and drive performance optimization.\nProvide technical direction and guidance to the development team, including code reviews, mentoring and ensuring the platform coding standards are being adhered to.\nEnsure that development processes and technologies are up-to-date\nDocument software design, code, and test procedures\nParticipate in the estimation of software projects and lead the planning and scheduling of projects.\nMentor junior members of the team and support their professional growth\nWhat You'll Need:\nStrong experience with\nC# (.NET Framework & Core)\nand\nSQL/MySQL\nSkilled in building\nweb services\nand\nsingle-page applications\nusing\nHTML, CSS, JavaScript\n, and modern\nJavaScript frameworks\nFamiliarity with\nTypeScript\n,\nES standards\n, and\nNoSQL databases\nis a plus\nSolid grasp of\nOOP\n,\ndesign patterns\n, and\nsoftware architecture\nExperience with\nmessage brokers\n,\nGit\n, and\nAgile development\nExposure to\nTDD\nor similar testing practices\nAttention to detail, especially in\nUX/UI\nWhat You'll Get to Work With:\nModern microservices architecture powering high-volume systems\nContainerisation using Docker and Kubernetes for scalable deployments\nCloud-native platforms and automated CI/CD pipelines\nReal-time performance engineering and distributed computing challenges\nSecure development practices with a focus on system architecture and compliance.\nContact Philip Boltt at Lorien Global for more information.\nGuidant, Carbon60, Lorien & SRG - The Impellam Group Portfolio are acting as an Employment Business in relation to this vacancy.\nIND_PC1\nBenefits:\nWork from home\nWork Location: In person",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CSQNYCQT7nHq8P0wNJS_USmk1iEIfTbn18KnDTRcZj2REsh-dS3EyW94Gc5aUmH6dwiQK0SrybDvkU_gfiL4EnQeLM4S1SgOoYsYrfgRBoM9E6HXScjfT6c6zN72CLAsFqxcDN1AByVubsvTvdw4O92Ay78fs2U5dDcde8EbkhJuix1kt1OgaLvV2apBerjLzHS-qVMT8LZgQ12_PmRGKr7_DoiK1PmlKf2yikr1M1TMIW3o043gbDNSfcZKJbdnsVCocT8BvLbJDs2dLZi9DrgYcbsa_Jq7FSU7D6UDVVOtAfTOUf1yAA6Hdw2egBTvN_bQyFibmiQ2XAJDXfVyq_HZto49fQP9V57YxpKIHhg0a6AhAy7H3rpOa-3WAIqkahRwWzGYQWJdIr0olqZTY8wUs4li4Gt-6RF_2GpX_vGAA8dvSr0_NxH515EuVF84hBuBC0TiSJvfXv44mODs8mXWBaLhyhPGwl9dCJmhmOvh2WjPX5kNWqbpp3TeokJJVIf3azzJkkqTM_Opl059kVlznV1ozQ_HzC9b9MSO27cRk3Dv0YZJ4Lm-fKEOpDVOKSpYmIo89S9y2eDd28UKB_SP49mvMK_9rRrjBBJvYnOWMWjQmpwWsmmsw0RYraxzLR3uIbUlJabCi4O4nr1Zu5MBuKbOJTlhY_Q5OLatbrimISvVx_oZa42DtM1O2s57YmcntxCQizYlxe01L0gxz5vnExNUfJBPM5GHivXaOsc--CKC34IOtihPIvSFnMPyzkoEmT1332JWvgRJZJpG8I0ukOAbuBp0j7DPc4wJtoZjUx3f0cAJLtNx7gi5_n6HOH10MMYZfKNF9poneSNtYqfKbB5xLnVZQqFtzk83GOxJUN4Oio9CY3wuqlo1CYnMJvhMzndhT3RQ==&xkcb=SoBa6_M3qblHrngdeD0DbzkdCdPP&camk=4HOcmqOLYrBMHm1x0onBYw==&p=8&fvj=0&vjs=3"
  },
  {
    "title": "Lead Software Engineer",
    "company": "true",
    "location": "Manchester M2 4JG",
    "salary": "£65,000 - £75,000 a year-Permanent",
    "job_type": "Permanent",
    "benefits": [],
    "description": "Join a forward-thinking technology company where your leadership will directly impact millions of users across three continents.\nLead Software Engineer - Manchester (Hybrid)\nLead the development of real-time, large-scale systems used by millions of users across the UK, North America and South Africa. This is a chance to work on business-critical software that directly drives user engagement and revenue.\nHybrid role based in Manchester city centre (2 days per week onsite)\nSalary: up to £75,000 + bonus\nAbout the Role:\nThe company is transitioning from monolithic architecture to microservices, with full application rebuilds and containerised deployments. As decisions get made at team level, you will have a say in the tech stack and development approach, with a strong emphasis on team collaboration.\nThis is a stimulating environment where systems must operate in real-time, requiring robust event-driven architectures, streaming data pipelines, and reactive programming. You'll tackle complex scalability challenges across distributed systems, ensuring speed and reliability under heavy user loads.\nSecurity and compliance are central to the platform, so you'll be involved in building secure systems with strong authentication, encryption, and adherence to regulatory standards.\nKey Responsibilities:\nAct as a liaison between the Engineering team and Senior Management, communicating project status and technical challenges\nAssume a leadership role in the company, representing the Engineering team and promoting best practices in software development\nFeature development and evaluation of the tooling processes both in development and deployment alongside the Platform Engineering team\nHelp resolve complex software challenges and drive performance optimisation\nProvide technical direction and guidance to the development team, including code reviews, mentoring and ensuring the platform coding standards are being adhered to\nEnsure that development processes and technologies are up-to-date\nDocument software design, code, and test procedures\nParticipate in the estimation of software projects and lead the planning and scheduling of projects\nMentor junior members of the team and support their professional growth\nWhat You'll Need:\nStrong experience with\nC# (.NET Framework & Core)\nand\nSQL/MySQL\nSkilled in building\nweb services\nand\nsingle-page applications\nusing\nHTML, CSS, JavaScript\n, and modern\nJavaScript frameworks\nFamiliarity with\nTypeScript\n,\nES standards\n, and\nNoSQL databases\nis a plus\nSolid grasp of\nOOP\n,\ndesign patterns\n, and\nsoftware architecture\nExperience with\nmessage brokers\n,\nGit\n, and\nAgile development\nExposure to\nTDD\nor similar testing practices\nAttention to detail, especially in\nUX/UI\nWhat You'll Get to Work With:\nModern microservices architecture powering high-volume systems\nContainerisation using Docker and Kubernetes for scalable deployments\nCloud-native platforms and automated CI/CD pipelines\nReal-time performance engineering and distributed computing challenges\nSecure development practices with a focus on system architecture and compliance\nContact Philip Boltt at Lorien Global for more information.\nCarbon60, Lorien & SRG - The Impellam Group STEM Portfolio are acting as an Employment Business in relation to this vacancy.\nIND_PC1",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0CSQNYCQT7nHq8P0wNJS_USmk1iEIfTbn18KnDTRcZj2REsh-dS3EyW94Gc5aUmH6dmW0epoFLHXz12v0dZvEZI1aiLnJvoaMvEKg7yXS9A8VEU3fsFItE8L0og0KQ7GrQHcgS2O1bxTy7QsJhDWFkxNvKowOiWO5f2_X0j9M7zzbLOlTmfsmKN3AEny7zcnn1OILvE3sYseTjkjAcnPrJB-PAq7GleBQxNOh6UJcJpNoOi85nOFQE73q5feH5YYXV5SilfeObxldFScewJpIKtgsk3nn8ZJHWad-IFVKsaaEumvKN0FK-3lg2ZnxUGnY4aB0lOyJAxYl7LvcqTTJJ40vDmADxTMsqLdvCWVbxxRuYiX_C1RsIUbJDLuuyJ4VZfEyCd5qAJKX2_xdIuSuKPieqK0oTQpGs-JDcsY2tY8qsCauLIfiQD4bYGzKOi-Lzz2jBONUXvpB5OWETurW1VhzZcsZzrdz5UHDvLEUbNcagm0OhlVAoqOTzFkmqmvldpM7lQt_l473_omrMJHK1Em7zG22z3NBr2eyOXGeMdOrli4wyeY90uH2krkWvKGu3KBJR7pNjNGhX1OAMiRq8j6fDwlTj1aABe9y914KsB2kufb4TxphsaouCaNTFPOQCCGwOGCN8dvgyWvpZFx7chSZ167mWNB1vYupdGq2SS3In5fN2h-SUEPYdFX2Rr_gzRA3-lasP4OLNU0VQCj0-QlidpWw0gPnsoVnL3_hRNGgQR_06gWgXSa9e5gUIant9TOizIrXlwWgpLyp5fZpup8Io2iz3KjdmnKHW2ZyUHYzSATQYTeqnDOSPlQyySeocoay4rgZ9I_cFQ84uVqbBgMhGxP0a4j__YogaAu3tq60ciZb8BmbsPKWV9YBlsol3aZx_nvK3jbA==&xkcb=SoDu6_M3qblHrngdeD0CbzkdCdPP&camk=4HOcmqOLYrBMHm1x0onBYw==&p=9&fvj=0&vjs=3"
  }
]