[
  {
    "title": "Backend Software Engineer AI - Cybersecurity",
    "company": "true",
    "location": "Knutsford WA16",
    "salary": "£90,000 - £130,000 a year-Permanent, Full-time",
    "job_type": "Full-time",
    "benefits": [
      "Company pension",
      "On-site gym",
      "Flexible schedule"
    ],
    "description": "Join a leading cybersecurity company where cutting-edge AI meets software engineering excellence.\nBackend Software Engineer / Developer (AI) Knutsford onsite to £130k\nAre you a technologist with a strong knowledge of AI and its practical uses within software engineering?\nYou could be joining a Cybersecurity technology company and enjoying a huge range of perks and benefits from continual learning and self-development opportunities (including \"buy any book\" policy) through to health and well-being, enhanced paternity packages, generous holiday allowance, inclusive social events and much more.\nAs a Backend Software Engineer you will drive the adoption of AI within the business, assessing how to effectively use AI to optimise production and then rolling out your recommendations across teams. You'll take ownership, working end-to-end on delivery projects using a range of technology as you see fit.\nThere's a culture of software engineering excellence, with a collaborative team environment that values knowledge sharing and continual improvement.\nLocation:\nYou'll join colleagues in amazing offices in Cheshire five days a week with a wide range of facilities and an array of perks including:\nFree lunch daily catered for by the onsite chef\nA range of afternoon treats and barista style coffee\nOnsite gym with trainer led classes including karate, yoga and sound bath, shower facilities\nAnd of course, all the latest kit to work with\nAbout you:\nYou have strong backend software engineering experience with any OO programming languages e.g. Java, C#, C++, Python, Golang\nYou have multi-agent AI experience within a commercial setting\nYou have strong business acumen\nYou believe in producing quality code and have experience with TDD and Pair Programming\nYou have a good knowledge of SQL and Networking (TCP/IP)\nYou have a thorough understanding of Computer Science fundamentals such as OOP, Data Structures, Algorithms, Design Patterns\nYou're collaborative, enjoy problem solving and are keen to pick up new skills\nWhat's in it for you:\nAs a Backend Software Engineer / Developer you will earn a highly competitive package including:\nSalary to £130k\n8% pension contribution\nLife Assurance and Income Protection\nEnhanced maternity / paternity packages\nPrivate Medical care for you and your family including same day GP appointments and prescriptions\nFlexible working hours\n25 days holiday\nCharitable donations matching scheme and much more\nApply now\nto find out more about this Backend Software Engineer / Developer (AI OOP Artificial Intelligence) opportunity.\nAt Client Server we believe in a diverse workplace that allows people to play to their strengths and continually learn. We're an equal opportunities employer whose people come from all walks of life and will never discriminate based on race, colour, religion, sex, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status. The clients we work with share our values.\nWork Location: In person",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0DRYaumO8DkiEviMdHNU0dhg61MD-WHH-A_0sXPHkkGO8wgK-xyjQQFb5YRTT3RLkEMGttfjslO1GHLO1PLNclo0xwD6CHiGG3jVxpZR1eJO02tLzVTWTUD4hejTgaBVBs_x6h73zdWD-4fMVCG_CBhiujkAZXFwfo7E3NV_8kG6djJaVnFR1iG2z0iKBj09GZKEXxnFrLcSRidJUdp3r-T4o41NhwHPdjHfHIm1GmJntPERRWYKI9mQ3S5HpGur4sKX5hGOqwOlmBepCOChus3zxKjMgGh2_53u-tF1bzUGeUfjvg0EZ6Oc2p6XGh5VsaO55m8jHUDeV2n7FLHGwGZrNBn7Thk0H4LqtMgSUB4uSuvWp7G00eUDB5MK3whviJPWj2vAOigf3yse0wHAwyzZI3bcOupLDKrl5qkwip_nIzQ1hQjbr-Zmw7lxUTACZRLvBnLBjz2MfbU2aP78uezLOgUg0NrpqwPX9It4JUOeasu0fmHgZX_Q9YUxbp2SZi_jjweuK0kMU37l3MhQN-h4-h_0R9MqFvr5Fd_k97F_R_edMoRoad-jMIAZHZ1p6fjR5QZYXAQU9IxjD-61vYVceTe4T0nx5fM_rkfPyRdw_lkTKxQYH0dhvCNuzymcf8g0dYcNF6u_ZF0BSnByY_sWGJX902W8dwiVmUSWzQjyrOJVE7z_9-yxPbZd2B1WrDyJlzX6RiAM54WZN5tsv4KzMrlPhZqWeAKXES9a0S2PQhR-Qapve0BGxJsFCDxcbQ=&xkcb=SoBj6_M3rWcGpUxYdJ0LbzkdCdPP&camk=H-lBaXMUocL6CrLjbOEHjg==&p=0&fvj=0&vjs=3"
  },
  {
    "title": "Senior Fullstack/Backend Software Developer",
    "company": "true",
    "location": "Elland HX5 9JP",
    "salary": null,
    "job_type": "Full-time",
    "benefits": [],
    "description": "Role Overview\nThe Senior Software Developer will lead the development of software applications that support A-SAFE's operations and products. This role involves designing and implementing complex software solutions, mentoring junior developers, and collaborating with cross-functional teams to ensure high-quality software delivery. The ideal candidate will have extensive experience in software development, strong leadership skills, and a deep understanding of modern development practices.\nHow you can help us in this role:\n1. Software Design and Development:\nLead the design, development, testing, and maintenance of software applications.\nWrite clean, efficient, and scalable code, following best practices and coding standards.\n2. Project Leadership:\nManage software development projects, ensuring timely delivery and adherence to specifications.\nCoordinate with cross-functional teams, including product management, QA, and operations.\n3. Mentorship and Team Development:\nMentor and guide junior developers, providing technical leadership and support.\nConduct code reviews and ensure adherence to best practices.\n4. System Architecture:\nDesign and implement robust and scalable system architectures.\nEnsure software applications are integrated seamlessly with existing systems and third-party services.\n5. Quality Assurance:\nOversee the implementation of automated testing frameworks and continuous integration/continuous deployment (CI/CD) pipelines.\nConduct thorough testing and debugging to ensure software quality and reliability.\n6. Innovation and Continuous Improvement:\nStay abreast of the latest software development trends and technologies.\nPropose and implement improvements to software development processes and systems.\nWhat we would like you to bring to our team:\nDegree in Computer Science, Software Engineering, or a related field.\nExtensive experience in software development, with proficiency in languages such as Java, C#, Python, or similar.\nExperience with web development frameworks and technologies (e.g., React, Angular, Node.js).\nStrong understanding of database management systems (e.g., SQL, NoSQL).\nFamiliarity with version control systems (e.g., Git) and development tools.\nProven leadership and project management skills.\nExcellent problem-solving and analytical abilities.\nStrong communication and interpersonal skills.\nAbility to work independently and handle multiple projects simultaneously.\nAbout A-SAFE\nA-SAFE is a leading global manufacturer of safety barriers and industrial protection products. With innovative solutions and cutting-edge technology, we help businesses enhance safety, efficiency, and operational performance across a wide range of industries.\nWhat we offer\nCompetitive salary and performance-based bonuses.\nComprehensive benefits package, including health insurance and retirement plans.\nOpportunities for professional growth and career advancement.\nSupportive and collaborative work environment.",
    "url": "https://uk.indeed.com/pagead/clk?mo=r&ad=-6NYlbfkN0Cw8L0AeE3bdmB8vSHTgBZABZUquYEU0WckJAsKi-wvphjsOfHIZecGQqYnkBlc7Cbch8kY49Ngc7smXXjqDmnOzuwjSSe0A4-N1v131N0fdVQwXNsiOhg-9WAJAfO4wK5oHt4ezbpZYFmJmX6wSrM8gT-SJCQ-qzSFf0w1O89sjquVGghr8DLM1ojIl3t2K6_gFWFOm3Yfct7TRTEWQ8x0oto_VPl6utyxEC6CKvaHWE8DJ04ee3P0rJNy1NNESmFee9nnTV6DpqOLCazegn9hkzMXvr9ykrYKGAo1hVUcKn6So8-MRMNkGNF7LTMC5lUUc4m5-5kZegAL9XkCWpsl8uKSG-vLLZrdlzZSFRuCblzeVqMSgIEAKHltjAH-o8YdXHghb7MZCtLGa_vz9l4Oburki9IdPiA7G94OZ-SLqX4n1CZPV5u4ysSexdux1RN3mwzNIjC1LruWBYPaqAzPT1fUeXv52wYEQoo49r3rwUezj4JblwuioP4jPi-YzTdC_lwtk4L8vUskxlRl4GGmxUO2OgkAJ9juidusCGtW9Z5RZRXNFkEtqWGubPjnMZvf5-197LlZW8XBCjIYn1lWh_6PkwPGrLO2Yzg8UR6m6wG3lxztn8qKzea0pH8oGDKNhWeFbjSiLLcNRTQ9RILeyjuWE11g5a0tB_y_cunPkQ==&xkcb=SoDX6_M3rWcGpUxYdJ0KbzkdCdPP&camk=ethIe0s0heeEPGHtdNkx3w==&p=1&fvj=0&vjs=3"
  }
]